app/controllers/problems_controller.rb

  def index
    @problems = Problem.all
---
SELECT "problems".* FROM "problems"

  def create
    @problem = Problem.new(problem_params)

    respond_to do |format|
      if @problem.save
---
INSERT INTO "problems" ("problem_id", "problem_statement", "flag", "supp_file", "upvote_downvote", "max_points", "successful_submissions", "total_submissions", "dirty_bit", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @problem.update(problem_params)
---
UPDATE "problems" SET "flag" = ?, "updated_at" = ? WHERE "problems"."id" = ?  [["flag", "qwerty1234"], ["updated_at", "2018-11-05 12:25:31.628759"], ["id", 1]]

  def submit

    @correct_problem = Problem.find(params[:id])
    x = @correct_problem.total_submissions + 1
    @correct_problem.update(total_submissions: x)
---
SELECT  "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "problems" SET "successful_submissions" = ?, "updated_at" = ? WHERE "problems"."id" = ?  [["successful_submissions", 1], ["updated_at", "2018-11-06 05:37:21.523884"], ["id", 1]]

    def set_problem
      @problem = Problem.find(params[:id])
---
SELECT  "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]