app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"
---
  def index
    @questions = Question.all

INSERT INTO "questions" ("Question_ID", "Problem_Name", "Max_Points", "Submissions", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["Question_ID", "CTF01123"], ["Problem_Name", "pwnme011"], ["Max_Points", "1000"], ["Submissions", "0"], ["created_at", "2018-10-23 10:18:52.831063"], ["updated_at", "2018-10-23 10:18:52.831063"]]
---
  def create
    @question = Question.new(question_params)

    respond_to do |format|
      if @question.save